USE `parking_system`;

-- --------------------------------------------------------

--
-- Схема на данните от таблица `users`
--

INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `user_type`) VALUES
('Milen', 'Petrov', 'milenp@fmi.uni-sofia.bg', '$2y$10$0ScDEg9R.qswXt23FDKEuOKUDCLWtbAcjTbKGfk6A0HLpO.Z9u6Ge', 'Щатен преподавател'),
('Alexander', 'Stefanov', 'astef@fmi.uni-sofia.bg', '$2y$10$9O0BFAYgQzX2r5Cv5N3ejeS3OGC147qy6.CHnclLxOCUEyYBU8tQS', 'Хоноруван преподавател'),
('Pesho', 'Peshov', 'pesho@gmail.com', '$2y$10$cK3BHiZl6Sc4LE3j/YN9Le/yB2I7H4EHaOZtsFTnEY8Bt0xhYY5MO', 'Студент');

--
-- Схема на данните от таблица `reservations`
--

INSERT INTO `reservations` (`user_id`, `slot_id`, `start_time`, `end_time`, `date`) VALUES
(2, 15, '09:00:00', '12:00:00', '2021-06-24'),
(2, 21, '14:00:00', '15:00:00', '2021-06-24'),
(2, 17, '18:00:00', '21:00:00', '2021-06-24'),
(3, 20, '16:00:00', '17:00:00', '2021-06-24'),
(3, 21, '17:00:00', '18:00:00', '2021-06-24'),
(3, 22, '18:00:00', '19:00:00', '2021-06-24'),
(3, 33, '09:00:00', '15:00:00', '2021-06-25'),
(3, 40, '16:00:00', '20:00:00', '2021-06-25'),
(1, 19, '15:00:00', '17:00:00', '2021-06-25'),
(1, 6, '07:00:00', '15:00:00', '2021-06-26'),
(1, 31, '18:00:00', '19:00:00', '2021-06-26'),
(1, 24, '19:00:00', '21:00:00', '2021-06-26');

-- --------------------------------------------------------

--
-- Схема на данните от таблица `schedules`
--

INSERT INTO `schedules` (`discipline_name`, `discipline_type`, `date`, `start_time`, `end_time`, `faculty`) VALUES
('AWS', 'Лекция', '2021-06-23', '10:00:00', '14:00:00', 'ФМИ'),
('WEB', 'Лекция', '2021-06-24', '09:00:00', '11:00:00', 'ФМИ'),
('AWS', 'Упражнение', '2021-06-24', '16:00:00', '19:00:00', 'ФЗФ'),
('Network programming', 'Упражнение', '2021-06-25', '11:00:00', '13:00:00', 'ФХФ'),
('JST', 'Лекция', '2021-06-25', '15:00:00', '18:00:00', 'ФМИ'),
('OOP', 'Упражнение', '2021-06-26', '08:00:00', '10:00:00', 'ФМИ'),
('OOP', 'Упражнение', '2021-06-26', '12:00:00', '14:00:00', 'ФМИ'),
('OOP', 'Лекция', '2021-06-26', '18:00:00', '21:00:00', 'ФХФ'),
('WEB', 'Упражнение', '2021-06-24', '10:00:00', '12:00:00', 'ФМИ'),
('Statistics', 'Упражнение', '2021-06-24', '18:00:00', '20:00:00', 'ФМИ'),
('OOP', 'Упражнение', '2021-06-25', '16:00:00', '18:00:00', 'ФЗФ');

-- --------------------------------------------------------

--
-- Схема на данните от таблица `user_schedules`
--

INSERT INTO `user_schedules` (`user_id`, `schedule_id`) VALUES
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(1, 5),
(1, 6),
(1, 7),
(1, 8),
(2, 9),
(2, 10),
(2, 11);